{
  "irVersion": "1.0",
  "project": "omniavatar-core",
  "repository": "https://github.com/plexusone/omniavatar-core",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-07-16",
      "highlights": [
        { "description": "New `render` package: provider-agnostic batch avatar video generation (submit narration audio, poll, download talking-head MP4)" },
        { "description": "Package `avatar` renamed to `live` so the real-time and batch surfaces are self-describing" }
      ],
      "changed": [
        { "description": "package `avatar` renamed to `live`; update imports to `github.com/plexusone/omniavatar-core/live` (type and function names unchanged)", "breaking": true, "commit": "4f4c725" },
        { "description": "`registry.ProviderFactory` renamed to `registry.LiveProviderFactory`", "breaking": true, "commit": "4f4c725" },
        { "description": "error string prefixes changed from `avatar:` to `live:` and `ProviderError` prefix from `avatar/` to `live/`", "breaking": true, "commit": "4f4c725" }
      ],
      "added": [
        { "description": "`render.Provider` interface with `Generate`, `Status`, and `Download` for asynchronous video generation", "commit": "7585f63" },
        { "description": "`render.AudioUploader` optional capability interface for providers that can host local audio files", "commit": "7585f63" },
        { "description": "`render.GenerateRequest` with `AudioURL` (primary, drives lip-sync from existing narration) and `Script` (secondary, provider TTS) inputs plus provider-specific `Extensions`", "commit": "7585f63" },
        { "description": "`render.Job`, `render.JobState` (with `Terminal()`), and `render.JobStatus` with normalized state plus provider-native `RawStatus`", "commit": "7585f63" },
        { "description": "`render.Wait` polling helper with context cancellation and configurable interval", "commit": "7585f63" },
        { "description": "Render sentinel errors: `ErrAudioUploadUnsupported`, `ErrInvalidRequest`, `ErrJobNotFound`, `ErrJobFailed`, `ErrJobNotCompleted`, `ErrProviderUnavailable`, `ErrProviderAuthFailed`, `ErrInvalidConfig`", "commit": "7585f63" },
        { "description": "`registry.RenderProviderFactory` type for render provider registration", "commit": "4f4c725" },
        { "description": "Unit tests for the `render` package (`Wait`, state transitions, request validation)", "commit": "b20c0b6" }
      ],
      "documentation": [
        { "description": "README.md and doc.go updated to document both `live` and `render` surfaces", "commit": "3e00d7c" },
        { "description": "MkDocs site added (interfaces reference for both surfaces, architecture, releases) with a `Docs` GitHub Actions workflow deploying via `mkdocs gh-deploy`", "commit": "0d753ea" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-07-12",
      "commit": "42e9e9a",
      "highlights": [
        { "description": "Initial release of omniavatar-core interfaces" },
        { "description": "Provider-agnostic avatar abstraction for real-time AI avatars" },
        { "description": "Support for HeyGen, Tavus, and bitHuman avatar providers" }
      ],
      "added": [
        { "description": "`avatar.Provider` interface for creating avatar sessions", "commit": "f289628" },
        { "description": "`avatar.Session` interface for managing avatar lifecycle (Start, WaitForJoin, Close)", "commit": "f289628" },
        { "description": "`avatar.AudioDestination` interface for streaming TTS audio to avatars", "commit": "f289628" },
        { "description": "`avatar.SessionConfig` for provider-agnostic session configuration", "commit": "f289628" },
        { "description": "`avatar.SessionCallbacks` for avatar events (OnAvatarJoined, OnPlaybackStarted, OnPlaybackFinished, OnError)", "commit": "f289628" },
        { "description": "`avatar.AudioConfig` with DefaultAudioConfig() for 24kHz mono PCM16", "commit": "f289628" },
        { "description": "`avatar.Metrics` for avatar performance metrics (join latency, playback latency)", "commit": "f289628" },
        { "description": "`registry.ProviderFactory` type for provider registration", "commit": "7e04677" },
        { "description": "`registry.ProviderConfig` with Extensions map for provider-specific options", "commit": "7e04677" },
        { "description": "`registry.WithAPIKey()`, `WithBaseURL()`, `WithExtension()` option functions", "commit": "7e04677" },
        { "description": "Sentinel errors: `ErrSessionNotStarted`, `ErrSessionAlreadyStarted`, `ErrAvatarJoinTimeout`, `ErrProviderNotFound`", "commit": "f289628" },
        { "description": "`avatar.ProviderError` for wrapping provider-specific errors", "commit": "f289628" }
      ],
      "documentation": [
        { "description": "README.md with architecture overview, interfaces, and usage examples", "commit": "0e8875a" },
        { "description": "Package documentation in doc.go with code examples", "commit": "0e8875a" },
        { "description": "Interface documentation with usage patterns", "commit": "f289628" }
      ]
    }
  ]
}
